; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph1 - mode
	image6 - mode
	thermograph0 - mode
	image2 - mode
	thermograph4 - mode
	spectrograph3 - mode
	image5 - mode
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation7 - direction
	Star8 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	GroundStation11 - direction
	Star12 - direction
	Star0 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph3)
	(supports instrument0 thermograph4)
	(supports instrument0 image5)
	(supports instrument0 image2)
	(supports instrument0 image6)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
)
(:goal (and
	(pointing satellite0 GroundStation10)
	(have_image Planet13 thermograph0)
	(have_image Planet14 spectrograph1)
	(have_image Planet15 thermograph0)
	(have_image Planet15 image5)
	(have_image Star16 spectrograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 groundstation10 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation10)
   goals met: 1 of 6
3. (turn_to satellite0 star0 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 star0)
   goals met: 0 of 6
4. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 6
5. (turn_to satellite0 groundstation10 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation10)
   goals met: 1 of 6
6. (turn_to satellite0 planet13 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 planet13)
   goals met: 0 of 6
7. (take_image satellite0 planet13 instrument0 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 1 of 6
8. (turn_to satellite0 groundstation10 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 groundstation10)
   goals met: 2 of 6
9. (turn_to satellite0 planet14 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 planet14)
   goals met: 1 of 6
10. (take_image satellite0 planet14 instrument0 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 2 of 6
11. (turn_to satellite0 groundstation10 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation10)
   goals met: 3 of 6
12. (turn_to satellite0 planet15 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 planet15)
   goals met: 2 of 6
13. (take_image satellite0 planet15 instrument0 image5)
   added: (have_image planet15 image5)
   goals met: 3 of 6
14. (take_image satellite0 planet15 instrument0 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 4 of 6
15. (turn_to satellite0 groundstation10 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 groundstation10)
   goals met: 5 of 6
16. (turn_to satellite0 star16 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 star16)
   goals met: 4 of 6
17. (take_image satellite0 star16 instrument0 spectrograph1)
   added: (have_image star16 spectrograph1)
   goals met: 5 of 6
18. (turn_to satellite0 groundstation10 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 groundstation10)
   goals met: 6 of 6
